{"data":{"site":{"siteMetadata":{"address":"15408 Ruthelent Street, Gardena CA 90249","phone":"(206)-6611202","email":"jasper920011@gmail.com","social":"https://www.linkedin.com/in/jasperwang","description":"A front-end developer based in Los Angeles, CA. I'm passionated about learning new technologies and build performant websites and applications.","education":[{"title":"University of Washington","time":"2015 - 2017","major":"Master of Communication in Digital Media","areas":["UX design and web analytics","Video storytelling"]},{"title":"Huazhong University of Sci. and Tech.","time":"2011 - 2015","major":"Bachelor of Media Study/Minor in Computer Science","areas":[]}],"experience":[{"accomplishments":["Lead projects and initiatives by reviewing code, making architectural decisions, managing code refactors, and coordinating with business, UI, UX, and product.","Build reusable UI components, scalable layouts, and complex ads displaying modules in a Vue+Python Flask App.","Develop and maintain JS libraries that support data logging and content embedding, and ads loading; And a Mapping components library that provides dynamic mapping, routing, and searching.","Experience bootstrapping and maintaining frontend projects/packages including type checking, linting, testing, transpiling modern JS, and shipping code targeting NPM users and Script users.","Leverage tools like Google lighthouse, WebPageSpeedTest, Webpack bundle analyzer to monitor performance metrics. And build adaptive user experience focusing on accessibility, SEO, and performance."],"company":"System1","intro":"","position":"Software Engineer, Frontend","techStack":["Vanilla JS","Vue/React","TypeScript/Flow","Jest/Cypress","Webpack/Babel/Lerna","Post CSS/SASS","Jinja/Python","AWS"],"time":"Oct 2018 - Present"},{"accomplishments":["Worked closely with clients, PMs, and designers to deliver features, manage expectations, and meet deadlines.","Built high-quality Shopify themes that are easy to customize, responsive, and performant.","Fixed bugs and performed optimizations for more than 20 Shopify sites.","Wrote Ruby scripts with Shopify Scripts API to automate discount campaigns and customize shipping and payment options.","Built Shopify apps boilerplate that handles installation and authentication with Shopify."],"company":"SeedCMS","intro":"","position":"Frontend Developer","techStack":["jQuery/React","SASS","Liquid/Ruby","Google Cloud"],"time":"Aug 2017 - Oct 2018"},{"accomplishments":["Wore multiple hats including UI, UX, and Dev to design and build landing pages.","Componentized frontend codebase to improve reusability and scalability.","Built a chat-bot prototype with Microsoft Bot Framework."],"company":"Wali","intro":"","position":"Part-time Frontend Developer","techStack":["jQuery/React","LESS/Bootstrap"],"time":"Sep 2016 - Aug 2017"},{"accomplishments":["Developed landing pages and UI components","Visualized data and created CSS/JS animations"],"company":"Hitachi","intro":"","position":"Frontend Developer Intern","techStack":["Vanilla JS","CSS3","HTML5"],"time":"Jun 2014 - Aug 2014"}]}}}}